{"parentSha1":"e4849720dc36754e26d3aa8f6ed5ea001e6644dc","path":"answers-db/books/Understanding Analysis/2. Sequences and Series/2.5 Subsequences and the Bolzano-Weierstrass Theorem/2.5.8","item":{"title":"2.5.8","attr":{"q":"<p>Another way to prove the Bolzano-Weierstrass Theorem is to show that every sequence contains a monotone subsequence. A useful device in this endeavor is the notion of a <em>peak term</em>. Given a sequence <span class=\"math inline\">(x_n)</span>, a particular term <span class=\"math inline\">x_m</span> is a peak term if no later term is the sequence exceeds it; ie.e, if <span class=\"math inline\">x_m \\geq x_n</span> for all <span class=\"math inline\">n \\geq m</span>.</p>"},"sha1":"a6c284270698c94f40c422b6eebede78f028424e"},"kids":[{"title":"(b)","attr":{"q":"<p>Show that every sequence contains a monotone subsequence and explain how this furnishes a new proof of the Bolzano-Weierstrass Theorem.</p>","a":"<p>When a sequence converges, it must converge from up or down (or both). Pick one and make monotone subsequence from that.</p>\n<p>When a sequence diverges, it's either bounded or not. If it's bounded then it must have converging subsequence and you can construct a monotone subsequence from that. If it's not bounded, then at every point there must be upcoming bigger (or smaller depending it's direction of growth) point. Keep doing it and you consturct monotone subsequence.</p>\n<p>If a sequence is bounded then it's monotone subsequence must converge.</p>"},"sha1":"480e37a78af45e8746525e0a82431b94be693e3a"},{"title":"(a)","attr":{"q":"<p>Find examples of sequences with zero, one, and two peak terms. Find an example of a sequence with infinitely many peak terms that is not monotone.</p>","a":"<p>The one that contains zero, one and two peak terms would look something like this</p>\n<p><img src=\"/answers/imgs/a.PNG\" /></p>\n<p>The other one that has infinitely many peak terms would look something like this</p>\n<p><img src=\"/answers/imgs/b.PNG\" /></p>"},"sha1":"913132f190aa61c83e3092912842c075012e771b"}]}